nrfconnect/sdk-nrf/lib/nrf_modem_lib/nrf91_sockets.c
/*
 * Copyright (c) 2018 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 *
 */

/**
 * @file
 * @brief nrf91 socket offload provider
 */

#include <nrf_modem.h>
#include <nrf_modem_os.h>
#include <errno.h>
#include <fcntl.h>
#include <zephyr/init.h>
#include <zephyr/net/socket_offload.h>
#include <zephyr/net/offloaded_netdev.h>
#include <zephyr/net/net_ip.h>
#include <nrf_socket.h>
#include <nrf_errno.h>
#include <nrf_gai_errors.h>
#include <sockets_internal.h>
#include <zephyr/sys/fdtable.h>
#include <zephyr/kernel.h>
#include <zephyr/net/offloaded_netdev.h>
#include <zephyr/net/conn_mgr_connectivity.h>
#include <zephyr/net/conn_mgr_connectivity_impl.h>
#include <zephyr/net/net_if.h>
#include <zephyr/sys/util_macro.h>

#if defined(CONFIG_POSIX_API)
#include <zephyr/posix/poll.h>
#include <zephyr/posix/sys/time.h>
#include <zephyr/posix/sys/socket.h>
#endif

#if defined(CONFIG_NET_SOCKETS_OFFLOAD)

/* Macro used to define a private Connection Manager connectivity context type.
 * Required but not implemented.
 */
#define NRF_MODEM_LIB_NET_IF_CTX_TYPE void *

#define OBJ_TO_SD(obj) (((struct nrf_sock_ctx *)obj)->nrf_fd)
#define OBJ_TO_CTX(obj) ((struct nrf_sock_ctx *)obj)

/* Offloading context related to nRF socket. */
static struct nrf_sock_ctx {
	int nrf_fd; /* nRF socket descriptior. */
	struct k_mutex *lock; /* Mutex associated with the socket. */
	struct k_poll_signal poll; /* poll() signal. */
} offload_ctx[NRF_MODEM_MAX_SOCKET_COUNT];

static K_MUTEX_DEFINE(ctx_lock);

static const struct socket_op_vtable nrf91_socket_fd_op_vtable;

/* Offloading disabled in general. */
static bool offload_disabled;
/* TLS offloading disabled only. */
static bool tls_offload_disabled;

static struct nrf_sock_ctx *allocate_ctx(int nrf_fd)
{
	struct nrf_sock_ctx *ctx = NULL;

	k_mutex_lock(&ctx_lock, K_FOREVER);

	for (int i = 0; i < ARRAY_SIZE(offload_ctx); i++) {
		if (offload_ctx[i].nrf_fd == -1) {
			ctx = &offload_ctx[i];
			ctx->nrf_fd = nrf_fd;
			break;
		}
	}

	k_mutex_unlock(&ctx_lock);

	return ctx;
}

static void release_ctx(struct nrf_sock_ctx *ctx)
{
	k_mutex_lock(&ctx_lock, K_FOREVER);

	ctx->nrf_fd = -1;
	ctx->lock = NULL;

	k_mutex_unlock(&ctx_lock);
}

static void z_to_nrf_ipv4(const struct sockaddr *z_in,
			  struct nrf_sockaddr_in *nrf_out)
{
	const struct sockaddr_in *ptr = (const struct sockaddr_in *)z_in;

	nrf_out->sin_port = ptr->sin_port;
	nrf_out->sin_family = NRF_AF_INET;
	nrf_out->sin_addr.s_addr = ptr->sin_addr.s_addr;
}

static void nrf_to_z_ipv4(struct sockaddr *z_out,
			  const struct nrf_sockaddr_in *nrf_in)
{
	struct sockaddr_in *ptr = (struct sockaddr_in *)z_out;

	ptr->sin_port = nrf_in->sin_port;
	ptr->sin_family = AF_INET;
	ptr->sin_addr.s_addr = nrf_in->sin_addr.s_addr;
}

static void z_to_nrf_ipv6(const struct sockaddr *z_in,
			  struct nrf_sockaddr_in6 *nrf_out)
{
	const struct sockaddr_in6 *ptr = (const struct sockaddr_in6 *)z_in;

	/* nrf_out->sin6_flowinfo field not used */
	nrf_out->sin6_port = ptr->sin6_port;
	nrf_out->sin6_family = NRF_AF_INET6;
	memcpy(nrf_out->sin6_addr.s6_addr, ptr->sin6_addr.s6_addr,
		sizeof(struct in6_addr));
	nrf_out->sin6_scope_id = (uint32_t)ptr->sin6_scope_id;
}

static void nrf_to_z_ipv6(struct sockaddr *z_out,
			  const struct nrf_sockaddr_in6 *nrf_in)
{
	struct sockaddr_in6 *ptr = (struct sockaddr_in6 *)z_out;

	/* nrf_sockaddr_in6 field .sin6_flowinfo not used */
	ptr->sin6_port = nrf_in->sin6_port;
	ptr->sin6_family = AF_INET6;
	memcpy(ptr->sin6_addr.s6_addr, nrf_in->sin6_addr.s6_addr,
		sizeof(struct nrf_in6_addr));
	ptr->sin6_scope_id = (uint8_t)nrf_in->sin6_scope_id;
}

static int z_to_nrf_optname(int z_in_level, int z_in_optname,
			    int *nrf_out_optname)
{
	int retval = 0;

	switch (z_in_level) {
	case SOL_TLS:
		switch (z_in_optname) {
		case TLS_SEC_TAG_LIST:
			*nrf_out_optname = NRF_SO_SEC_TAG_LIST;
			break;
		case TLS_HOSTNAME:
			*nrf_out_optname = NRF_SO_SEC_HOSTNAME;
			break;
		case TLS_CIPHERSUITE_LIST:
			*nrf_out_optname = NRF_SO_SEC_CIPHERSUITE_LIST;
			break;
		case TLS_PEER_VERIFY:
			*nrf_out_optname = NRF_SO_SEC_PEER_VERIFY;
			break;
		case TLS_DTLS_ROLE:
			*nrf_out_optname = NRF_SO_SEC_ROLE;
			break;
		case TLS_SESSION_CACHE:
			*nrf_out_optname = NRF_SO_SEC_SESSION_CACHE;
			break;
		case TLS_SESSION_CACHE_PURGE:
			*nrf_out_optname = NRF_SO_SEC_SESSION_CACHE_PURGE;
			break;
		case TLS_DTLS_HANDSHAKE_TIMEO:
			*nrf_out_optname = NRF_SO_SEC_DTLS_HANDSHAKE_TIMEO;
			break;
		case TLS_CIPHERSUITE_USED:
			*nrf_out_optname = NRF_SO_SEC_CIPHERSUITE_USED;
			break;
		case TLS_DTLS_CID:
			*nrf_out_optname = NRF_SO_SEC_DTLS_CID;
			break;
		case TLS_DTLS_CID_STATUS:
			*nrf_out_optname = NRF_SO_SEC_DTLS_CID_STATUS;
			break;
		case TLS_DTLS_CONN_SAVE:
			*nrf_out_optname = NRF_SO_SEC_DTLS_CONN_SAVE;
			break;
		case TLS_DTLS_CONN_LOAD:
			*nrf_out_optname = NRF_SO_SEC_DTLS_CONN_LOAD;
			break;
		case TLS_DTLS_HANDSHAKE_STATUS:
			*nrf_out_optname = NRF_SO_SEC_HANDSHAKE_STATUS;
			break;
		default:
			retval = -1;
			break;
		}
		break;

	case SOL_SOCKET:
		switch (z_in_optname) {
		case SO_ERROR:
			*nrf_out_optname = NRF_SO_ERROR;
			break;
		case SO_KEEPOPEN:
			*nrf_out_optname = NRF_SO_KEEPOPEN;
			break;
		case SO_EXCEPTIONAL_DATA:
			*nrf_out_optname = NRF_SO_EXCEPTIONAL_DATA;
			break;
		case SO_RCVTIMEO:
			*nrf_out_optname = NRF_SO_RCVTIMEO;
			break;
		case SO_SNDTIMEO:
			*nrf_out_optname = NRF_SO_SNDTIMEO;
			break;
		case SO_BINDTOPDN:
			*nrf_out_optname = NRF_SO_BINDTOPDN;
			break;
		case SO_REUSEADDR:
			*nrf_out_optname = NRF_SO_REUSEADDR;
			break;

		/* SO_RAI_* and NRF_SO_RAI_* are deprecated */
		case SO_RAI_LAST:
			*nrf_out_optname = NRF_SO_RAI_LAST;
			break;
		case SO_RAI_NO_DATA:
			*nrf_out_optname = NRF_SO_RAI_NO_DATA;
			break;
		case SO_RAI_ONE_RESP:
			*nrf_out_optname = NRF_SO_RAI_ONE_RESP;
			break;
		case SO_RAI_ONGOING:
			*nrf_out_optname = NRF_SO_RAI_ONGOING;
			break;
		case SO_RAI_WAIT_MORE:
			*nrf_out_optname = NRF_SO_RAI_WAIT_MORE;
			break;
		case SO_RAI:
			*nrf_out_optname = NRF_SO_RAI;
			break;
		default:
			retval = -1;
			break;
		}
		break;

	case IPPROTO_IP:
		switch (z_in_optname) {
		case SO_IP_ECHO_REPLY:
			*nrf_out_optname = NRF_SO_IP_ECHO_REPLY;
			break;
		default:
			retval = -1;
			break;
		}
		break;

