nrfconnect/sdk-nrf/lib/nrf_modem_lib/nrf91_sockets.c
	case IPPROTO_IPV6:
		switch (z_in_optname) {
		case SO_IPV6_ECHO_REPLY:
			*nrf_out_optname = NRF_SO_IPV6_ECHO_REPLY;
			break;
		default:
			retval = -1;
			break;
		}
		break;

	case IPPROTO_TCP:
		switch (z_in_optname) {
		case SO_TCP_SRV_SESSTIMEO:
			*nrf_out_optname = NRF_SO_TCP_SRV_SESSTIMEO;
			break;
		default:
			retval = -1;
			break;
		}
		break;

	case IPPROTO_ALL:
		switch (z_in_optname) {
		case SO_SILENCE_ALL:
			*nrf_out_optname = NRF_SO_SILENCE_ALL;
			break;
		default:
			retval = -1;
			break;
		}
		break;

	default:
		retval = -1;
		break;
	}

	return retval;
}

static void z_to_nrf_addrinfo_hints(const struct zsock_addrinfo *z_in,
				   struct nrf_addrinfo *nrf_out)
{
	memset(nrf_out, 0, sizeof(struct nrf_addrinfo));

	nrf_out->ai_flags = z_in->ai_flags;
	nrf_out->ai_socktype = z_in->ai_socktype;
	nrf_out->ai_family = z_in->ai_family;
	nrf_out->ai_protocol = z_in->ai_protocol;

	if (z_in->ai_canonname != NULL) {
		nrf_out->ai_canonname = z_in->ai_canonname;
	}
}

static int nrf_to_z_addrinfo(struct zsock_addrinfo *z_out,
			     const struct nrf_addrinfo *nrf_in)
{
	z_out->ai_next = NULL;
	z_out->ai_flags = nrf_in->ai_flags;
	z_out->ai_socktype = nrf_in->ai_socktype;

	z_out->ai_family = nrf_in->ai_family;
	z_out->ai_protocol = nrf_in->ai_protocol;

	if (nrf_in->ai_family == NRF_AF_INET) {
		z_out->ai_addr = k_malloc(sizeof(struct sockaddr_in));
		if (z_out->ai_addr == NULL) {
			return -ENOMEM;
		}
		z_out->ai_addrlen  = sizeof(struct sockaddr_in);
		nrf_to_z_ipv4(z_out->ai_addr,
			(const struct nrf_sockaddr_in *)nrf_in->ai_addr);
	} else if (nrf_in->ai_family == NRF_AF_INET6) {
		z_out->ai_addr = k_malloc(sizeof(struct sockaddr_in6));
		if (z_out->ai_addr == NULL) {
			return -ENOMEM;
		}
		z_out->ai_addrlen  = sizeof(struct sockaddr_in6);
		nrf_to_z_ipv6(z_out->ai_addr,
			(const struct nrf_sockaddr_in6 *)nrf_in->ai_addr);
	} else {
		return -EAFNOSUPPORT;
	}

	if (nrf_in->ai_canonname) {
		strncpy(z_out->_ai_canonname, nrf_in->ai_canonname,
			sizeof(z_out->_ai_canonname));
		z_out->_ai_canonname[sizeof(z_out->_ai_canonname) - 1] = '\0';
		z_out->ai_canonname = z_out->_ai_canonname;
	} else {
		z_out->ai_canonname = NULL;
	}

	return 0;
}

static int nrf91_socket_offload_socket(int family, int type, int proto)
{
	int retval;

	retval = nrf_socket(family, type, proto);

	return retval;
}

static int nrf91_socket_offload_accept(void *obj, struct sockaddr *addr,
				       socklen_t *addrlen)
{
	int fd = z_reserve_fd();
	int sd = OBJ_TO_SD(obj);
	int new_sd = -1;
	struct nrf_sock_ctx *ctx = NULL;
	struct nrf_sockaddr *nrf_addr_ptr = NULL;
	nrf_socklen_t *nrf_addrlen_ptr = NULL;
	/* Use `struct nrf_sockaddr_in6` to fit both, IPv4 and IPv6 */
	struct nrf_sockaddr_in6 nrf_addr;
	nrf_socklen_t nrf_addrlen;

	/* `z_reserve_fd()` can fail */
	if (fd < 0) {
		return -1;
	}

	if ((addr != NULL) && (addrlen != NULL)) {
		nrf_addr_ptr = (struct nrf_sockaddr *)&nrf_addr;
		nrf_addrlen_ptr = &nrf_addrlen;

		/* Workaround for the nrf_modem_lib issue, making `nrf_accept` to
		 * expect `nrf_addrlen` to be exactly of
		 * sizeof(struct nrf_sockaddr_in) size for IPv4
		 */
		if (*addrlen == sizeof(struct sockaddr_in)) {
			nrf_addrlen = sizeof(struct nrf_sockaddr_in);
		} else {
			nrf_addrlen = sizeof(struct nrf_sockaddr_in6);
		}
	}

	new_sd = nrf_accept(sd, nrf_addr_ptr, nrf_addrlen_ptr);
	if (new_sd < 0) {
		/* nrf_accept sets errno appropriately */
		goto error;
	}

	ctx = allocate_ctx(new_sd);
	if (ctx == NULL) {
		errno = ENOMEM;
		goto error;
	}

	if ((addr != NULL) && (addrlen != NULL)) {
		if (nrf_addr_ptr->sa_family == NRF_AF_INET) {
			*addrlen = sizeof(struct sockaddr_in);
			nrf_to_z_ipv4(
			    addr, (const struct nrf_sockaddr_in *)&nrf_addr);
		} else if (nrf_addr_ptr->sa_family == NRF_AF_INET6) {
			*addrlen = sizeof(struct sockaddr_in6);
			nrf_to_z_ipv6(
			    addr, (const struct nrf_sockaddr_in6 *)&nrf_addr);
		} else {
			errno = ENOTSUP;
			goto error;
		}
	}

	z_finalize_fd(fd, ctx,
		      (const struct fd_op_vtable *)&nrf91_socket_fd_op_vtable);

	return fd;

error:
	if (new_sd >= 0) {
		nrf_close(new_sd);
	}

	if (ctx != NULL) {
		release_ctx(ctx);
	}

	z_free_fd(fd);
	return -1;
}

static int nrf91_socket_offload_bind(void *obj, const struct sockaddr *addr,
				     socklen_t addrlen)
{
	int sd = OBJ_TO_SD(obj);
	int retval;

	if (addr->sa_family == AF_INET) {
		struct nrf_sockaddr_in ipv4;

		z_to_nrf_ipv4(addr, &ipv4);
		retval = nrf_bind(sd, (const struct nrf_sockaddr *)&ipv4,
				  sizeof(struct nrf_sockaddr_in));
	} else if (addr->sa_family == AF_INET6) {
		struct nrf_sockaddr_in6 ipv6;

		z_to_nrf_ipv6(addr, &ipv6);
		retval = nrf_bind(sd, (const struct nrf_sockaddr *)&ipv6,
				  sizeof(struct nrf_sockaddr_in6));
	} else {
		errno = EAFNOSUPPORT;
		retval = -1;
	}

	return retval;
}

static int nrf91_socket_offload_listen(void *obj, int backlog)
{
	int sd = OBJ_TO_SD(obj);

	return nrf_listen(sd, backlog);
}

static int nrf91_socket_offload_connect(void *obj, const struct sockaddr *addr,
					socklen_t addrlen)
{
	int sd = OBJ_TO_SD(obj);
	int retval;

	if (addr->sa_family == AF_INET) {
		struct nrf_sockaddr_in ipv4;

		z_to_nrf_ipv4(addr, &ipv4);
		retval = nrf_connect(sd, (struct nrf_sockaddr *)&ipv4,
				     sizeof(struct nrf_sockaddr_in));
	} else if (addr->sa_family == AF_INET6) {
		struct nrf_sockaddr_in6 ipv6;

		z_to_nrf_ipv6(addr, &ipv6);
		retval = nrf_connect(sd, (struct nrf_sockaddr *)&ipv6,
				  sizeof(struct nrf_sockaddr_in6));
	} else {
		/* Pass in raw to library as it is non-IP address. */
		retval = nrf_connect(sd, (void *)addr, addrlen);
	}

	return retval;
}

static int nrf91_socket_offload_setsockopt(void *obj, int level, int optname,
					   const void *optval, socklen_t optlen)
{
	int sd = OBJ_TO_SD(obj);
	int retval;
	int nrf_level = level;
	int nrf_optname;
	struct nrf_timeval nrf_timeo = { 0 };
	void *nrf_optval = (void *)optval;
	nrf_socklen_t nrf_optlen = optlen;

	if ((level == SOL_SOCKET) && (optname == SO_BINDTODEVICE)) {
		if (IS_ENABLED(CONFIG_NET_SOCKETS_OFFLOAD_DISPATCHER)) {
			/* This is used by socket dispatcher in zephyr and is forwarded to the
			 * offloading layer afterwards. We don't have to do anything in this case.
			 */
			return 0;
		}

		errno = EOPNOTSUPP;
		return -1;
	}

	if (z_to_nrf_optname(level, optname, &nrf_optname) < 0) {
		errno = ENOPROTOOPT;
		return -1;
	}

	if ((level == SOL_SOCKET) && ((optname == SO_RCVTIMEO) ||
				      (optname == SO_SNDTIMEO))) {
		if (optval != NULL) {
			nrf_timeo.tv_sec = ((struct timeval *)optval)->tv_sec;
			nrf_timeo.tv_usec = ((struct timeval *)optval)->tv_usec;
			nrf_optval = &nrf_timeo;
			nrf_optlen = sizeof(struct nrf_timeval);
		}
	} else if ((level == SOL_TLS) && (optname == TLS_SESSION_CACHE)) {
		nrf_optlen = sizeof(int);
	}

