nrfconnect/sdk-nrf/lib/nrf_modem_lib/nrf91_sockets.c
	retval = nrf_setsockopt(sd, nrf_level, nrf_optname, nrf_optval,
				nrf_optlen);

	return retval;
}

static int nrf91_socket_offload_getsockopt(void *obj, int level, int optname,
					   void *optval, socklen_t *optlen)
{
	int sd = OBJ_TO_SD(obj);
	int retval;
	int nrf_level = level;
	int nrf_optname;
	struct nrf_timeval nrf_timeo = {0, 0};
	nrf_socklen_t nrf_timeo_size = sizeof(struct nrf_timeval);
	void *nrf_optval = optval;
	nrf_socklen_t *nrf_optlen = (nrf_socklen_t *)optlen;

	if (z_to_nrf_optname(level, optname, &nrf_optname) < 0) {
		errno = ENOPROTOOPT;
		return -1;
	}

	if ((level == SOL_SOCKET) && ((optname == SO_RCVTIMEO) ||
		(optname == SO_SNDTIMEO))) {
		nrf_optval = &nrf_timeo;
		nrf_optlen = &nrf_timeo_size;
	}

	retval = nrf_getsockopt(sd, nrf_level, nrf_optname, nrf_optval,
				nrf_optlen);

	/* The call was successful so we can assume that both
	 * `nrf_optval` (`optval`) and `nrf_optlen` (`optlen`)
	 * are not NULL, so we can dereference them.
	 */
	if (retval == 0) {
		if (level == SOL_SOCKET) {
			if (optname == SO_ERROR) {
				/* Use nrf_modem_os_errno_set() to translate from nRF
				 * error to native error. If there is no error,
				 * don't translate it.
				 */
				if (*(int *)optval != 0) {
					nrf_modem_os_errno_set(*(int *)optval);
					*(int *)optval = errno;
				}
			} else if ((optname == SO_RCVTIMEO) ||
				(optname == SO_SNDTIMEO)) {
				((struct timeval *)optval)->tv_sec =
					nrf_timeo.tv_sec;
				((struct timeval *)optval)->tv_usec =
					nrf_timeo.tv_usec;
				*optlen = sizeof(struct timeval);
			}
		}
	}

	return retval;
}

static ssize_t nrf91_socket_offload_recvfrom(void *obj, void *buf, size_t len,
					     int flags, struct sockaddr *from,
					     socklen_t *fromlen)
{
	struct nrf_sock_ctx *ctx = OBJ_TO_CTX(obj);
	ssize_t retval;

	if (ctx->lock) {
		(void) k_mutex_unlock(ctx->lock);
	}

	if (from == NULL || fromlen == NULL) {
		retval = nrf_recvfrom(ctx->nrf_fd, buf, len, flags, NULL, NULL);
	} else {
		/* Allocate space for maximum of IPv4 and IPv6 family type. */
		struct nrf_sockaddr_in6 cliaddr_storage = {0};
		nrf_socklen_t sock_len = sizeof(struct nrf_sockaddr_in6);
		struct nrf_sockaddr *cliaddr = (struct nrf_sockaddr *)&cliaddr_storage;

		retval = nrf_recvfrom(ctx->nrf_fd, buf, len, flags, cliaddr, &sock_len);
		if (retval < 0) {
			goto exit;
		}

		if (cliaddr->sa_family == NRF_AF_INET &&
		    sock_len == sizeof(struct nrf_sockaddr_in)) {
			nrf_to_z_ipv4(from, (struct nrf_sockaddr_in *)cliaddr);
			*fromlen = sizeof(struct sockaddr_in);
		} else if (cliaddr->sa_family == NRF_AF_INET6 &&
			   sock_len == sizeof(struct nrf_sockaddr_in6)) {
			nrf_to_z_ipv6(from, (struct nrf_sockaddr_in6 *)cliaddr);
			*fromlen = sizeof(struct sockaddr_in6);
		}
	}

exit:
	/* Context might have been freed during this call.
	 * Check again before accessing.
	 */
	if (ctx->lock) {
		(void) k_mutex_lock(ctx->lock, K_FOREVER);
	}

	return retval;
}

static ssize_t nrf91_socket_offload_sendto(void *obj, const void *buf,
					   size_t len, int flags,
					   const struct sockaddr *to,
					   socklen_t tolen)
{
	int sd = OBJ_TO_SD(obj);
	struct nrf_sock_ctx *ctx = OBJ_TO_CTX(obj);
	ssize_t retval;

	if (ctx->lock) {
		(void)k_mutex_unlock(ctx->lock);
	}

	if (to == NULL) {
		retval = nrf_sendto(sd, buf, len, flags, NULL, 0);
	} else if (to->sa_family == AF_INET) {
		struct nrf_sockaddr_in ipv4;
		nrf_socklen_t sock_len = sizeof(struct nrf_sockaddr_in);

		z_to_nrf_ipv4(to, &ipv4);
		retval = nrf_sendto(sd, buf, len, flags, (struct nrf_sockaddr *)&ipv4, sock_len);
	} else if (to->sa_family == AF_INET6) {
		struct nrf_sockaddr_in6 ipv6;
		nrf_socklen_t sock_len = sizeof(struct nrf_sockaddr_in6);

		z_to_nrf_ipv6(to, &ipv6);
		retval = nrf_sendto(sd, buf, len, flags, (struct nrf_sockaddr *)&ipv6, sock_len);
	} else {
		errno = EAFNOSUPPORT;
		retval = -1;
	}

	/* Context might have been freed during this call.
	 * Check again before accessing.
	 */
	if (ctx->lock) {
		(void) k_mutex_lock(ctx->lock, K_FOREVER);
	}

	return retval;
}

static ssize_t nrf91_socket_offload_sendmsg(void *obj, const struct msghdr *msg,
					    int flags)
{
	ssize_t len = 0;
	ssize_t ret;
	ssize_t offset;
	int i;
	static K_MUTEX_DEFINE(sendmsg_lock);
	static uint8_t buf[CONFIG_NRF_MODEM_LIB_SENDMSG_BUF_SIZE];

	if (msg == NULL) {
		errno = EINVAL;
		return -1;
	}

	/* Try to reduce number of `sendto` calls - copy data if they fit into
	 * a single buffer
	 */

	for (i = 0; i < msg->msg_iovlen; i++) {
		len += msg->msg_iov[i].iov_len;
	}

	if (len <= sizeof(buf)) {
		/* Protect `buf` access with a mutex. */
		k_mutex_lock(&sendmsg_lock, K_FOREVER);
		len = 0;

		for (i = 0; i < msg->msg_iovlen; i++) {
			memcpy(buf + len, msg->msg_iov[i].iov_base,
			       msg->msg_iov[i].iov_len);
			len += msg->msg_iov[i].iov_len;
		}

		offset = 0;
		ret = 0;
		while ((offset < len) && (ret >= 0)) {
			ret = nrf91_socket_offload_sendto(obj,
				(buf + offset), (len - offset), flags,
				msg->msg_name, msg->msg_namelen);
			if (ret > 0) {
				offset += ret;
			}
		}

		k_mutex_unlock(&sendmsg_lock);
		return ret;
	}

	/* If the data won't fit into intermediate buffer, send the buffers
	 * separately
	 */

	len = 0;

	for (i = 0; i < msg->msg_iovlen; i++) {
		if (msg->msg_iov[i].iov_len == 0) {
			continue;
		}

		offset = 0;
		while (offset < msg->msg_iov[i].iov_len) {
			ret = nrf91_socket_offload_sendto(obj,
				(((uint8_t *) msg->msg_iov[i].iov_base) + offset),
				(msg->msg_iov[i].iov_len - offset), flags,
				msg->msg_name, msg->msg_namelen);
			if (ret < 0) {
				return ret;
			}
			offset += ret;
			len += ret;
		}
	}

	return len;
}

static void nrf91_socket_offload_freeaddrinfo(struct zsock_addrinfo *root)
{
	struct zsock_addrinfo *next = root;

	while (next != NULL) {
		struct zsock_addrinfo *this = next;

		next = next->ai_next;
		k_free(this->ai_addr);
		k_free(this);
	}
}

static int nrf91_socket_offload_getaddrinfo(const char *node,
					    const char *service,
					    const struct zsock_addrinfo *hints,
					    struct zsock_addrinfo **res)
{
	int err;
	struct nrf_addrinfo nrf_hints;
	struct nrf_addrinfo *nrf_res = NULL;
	struct nrf_addrinfo *nrf_hints_ptr = NULL;
	static K_MUTEX_DEFINE(getaddrinfo_lock);

	memset(&nrf_hints, 0, sizeof(struct nrf_addrinfo));

	if (hints != NULL) {
		z_to_nrf_addrinfo_hints(hints, &nrf_hints);
		nrf_hints_ptr = &nrf_hints;
	}

	k_mutex_lock(&getaddrinfo_lock, K_FOREVER);
	int retval = nrf_getaddrinfo(node, service, nrf_hints_ptr, &nrf_res);

	if (retval != 0) {
		goto error;
	}

