nrfconnect/sdk-nrf/lib/nrf_modem_lib/nrf91_sockets.c
	struct nrf_addrinfo *next_nrf_res = nrf_res;
	struct zsock_addrinfo *latest_z_res = NULL;

	*res = NULL;

	while ((retval == 0) && (next_nrf_res != NULL)) {
		struct zsock_addrinfo *next_z_res =
					k_malloc(sizeof(struct zsock_addrinfo));

		if (next_z_res == NULL) {
			retval = DNS_EAI_MEMORY;
			break;
		}

		err = nrf_to_z_addrinfo(next_z_res, next_nrf_res);
		if (err == -ENOMEM) {
			retval = DNS_EAI_MEMORY;
			k_free(next_z_res);
			break;
		} else if (err == -EAFNOSUPPORT) {
			retval = DNS_EAI_FAMILY;
			k_free(next_z_res);
			break;
		}

		if (latest_z_res == NULL) {
			/* This is the first node processed. */
			*res = next_z_res;
		} else {
			latest_z_res->ai_next = next_z_res;
		}
		latest_z_res = next_z_res;
		next_nrf_res = next_nrf_res->ai_next;
	}
	if (retval != 0) {
		/* Release any already allocated list nodes. */
		nrf91_socket_offload_freeaddrinfo(*res);
		*res = NULL;
	}
	nrf_freeaddrinfo(nrf_res);

error:
	k_mutex_unlock(&getaddrinfo_lock);
	return retval;
}

static int nrf91_socket_offload_fcntl(int fd, int cmd, va_list args)
{
	int retval;
	int flags;

	switch (cmd) {
	case F_SETFL:
		flags = va_arg(args, int);
		if (flags != 0 && flags != O_NONBLOCK) {
			errno = EINVAL;
			retval = -1;
		}

		/* Translate flags from native to nRF */
		flags = (flags & O_NONBLOCK) ? NRF_O_NONBLOCK : 0;

		retval = nrf_fcntl(fd, NRF_F_SETFL, flags);

		break;
	case F_GETFL:
		flags = nrf_fcntl(fd, NRF_F_GETFL, 0);

		/* Translate flags from nRF to native */
		retval = (flags & NRF_O_NONBLOCK) ? O_NONBLOCK : 0;

		break;
	default:
		errno = EINVAL;
		retval = -1;
	}

	return retval;
}

static struct nrf_sock_ctx *find_ctx(int fd)
{
	for (size_t i = 0; i < ARRAY_SIZE(offload_ctx); i++) {
		if (offload_ctx[i].nrf_fd == fd) {
			return &offload_ctx[i];
		}
	}

	return NULL;
}

static void pollcb(struct nrf_pollfd *pollfd)
{
	struct nrf_sock_ctx *ctx;

	ctx = find_ctx(pollfd->fd);
	if (!ctx) {
		return;
	}

	k_poll_signal_raise(&ctx->poll, pollfd->revents);
}

static int nrf91_poll_prepare(struct nrf_sock_ctx *ctx, struct zsock_pollfd *pfd,
			      struct k_poll_event **pev, struct k_poll_event *pev_end)
{
	int err;
	int flags;
	unsigned int signaled;
	int fd = OBJ_TO_SD(ctx);
	struct nrf_modem_pollcb pcb = {
		.callback = pollcb,
		.events = pfd->events,
		.oneshot = true, /* callback invoked only once */
	};

	if (*pev == pev_end) {
		errno = ENOMEM;
		return -1;
	}

	k_poll_signal_init(&ctx->poll);
	k_poll_event_init(*pev, K_POLL_TYPE_SIGNAL, K_POLL_MODE_NOTIFY_ONLY, &ctx->poll);

	err = nrf_setsockopt(fd, NRF_SOL_SOCKET, NRF_SO_POLLCB, &pcb, sizeof(pcb));
	if (err) {
		return -1;
	}

	/* Let other sockets use another k_poll_event */
	(*pev)++;

	signaled = 0;
	flags = 0;

	k_poll_signal_check(&ctx->poll, &signaled, &flags);
	if (!signaled) {
		return 0;
	}

	/* Events are ready, don't wait */
	return -EALREADY;
}

static int nrf91_poll_update(struct nrf_sock_ctx *ctx, struct zsock_pollfd *pfd,
			     struct k_poll_event **pev)
{
	int flags;
	unsigned int signaled;

	(*pev)++;

	signaled = 0;
	flags = 0;

	k_poll_signal_check(&ctx->poll, &signaled, &flags);
	if (!signaled) {
		return 0;
	}

	pfd->revents = flags;

	return 0;
}

static int nrf91_socket_offload_ioctl(void *obj, unsigned int request,
				      va_list args)
{
	int sd = OBJ_TO_SD(obj);

	switch (request) {
	case ZFD_IOCTL_POLL_PREPARE: {
		struct zsock_pollfd *pfd;
		struct k_poll_event **pev;
		struct k_poll_event *pev_end;

		pfd = va_arg(args, struct zsock_pollfd *);
		pev = va_arg(args, struct k_poll_event **);
		pev_end = va_arg(args, struct k_poll_event *);

		return nrf91_poll_prepare(obj, pfd, pev, pev_end);
	}

	case ZFD_IOCTL_POLL_UPDATE: {
		struct zsock_pollfd *pfd;
		struct k_poll_event **pev;

		pfd = va_arg(args, struct zsock_pollfd *);
		pev = va_arg(args, struct k_poll_event **);

		return nrf91_poll_update(obj, pfd, pev);
	}

	case ZFD_IOCTL_POLL_OFFLOAD:
		return -EOPNOTSUPP;

	case ZFD_IOCTL_SET_LOCK: {
		struct nrf_sock_ctx *ctx = OBJ_TO_CTX(obj);

		ctx->lock = va_arg(args, struct k_mutex *);

		return 0;
	}

	/* Otherwise, just forward to offloaded fcntl()
	 * In Zephyr, fcntl() is just an alias of ioctl().
	 */
	default:
		return nrf91_socket_offload_fcntl(sd, request, args);
	}
}

static ssize_t nrf91_socket_offload_read(void *obj, void *buffer, size_t count)
{
	return nrf91_socket_offload_recvfrom(obj, buffer, count, 0, NULL, 0);
}

static ssize_t nrf91_socket_offload_write(void *obj, const void *buffer,
					  size_t count)
{
	return nrf91_socket_offload_sendto(obj, buffer, count, 0, NULL, 0);
}

static int nrf91_socket_offload_close(void *obj)
{
	struct nrf_sock_ctx *ctx = OBJ_TO_CTX(obj);
	int retval;

	retval = nrf_close(ctx->nrf_fd);
	if (retval == 0) {
		release_ctx(ctx);
	}

	return retval;
}

static const struct socket_op_vtable nrf91_socket_fd_op_vtable = {
	.fd_vtable = {
		.read = nrf91_socket_offload_read,
		.write = nrf91_socket_offload_write,
		.close = nrf91_socket_offload_close,
		.ioctl = nrf91_socket_offload_ioctl,
	},
	.bind = nrf91_socket_offload_bind,
	.connect = nrf91_socket_offload_connect,
	.listen = nrf91_socket_offload_listen,
	.accept = nrf91_socket_offload_accept,
	.sendto = nrf91_socket_offload_sendto,
	.sendmsg = nrf91_socket_offload_sendmsg,
	.recvfrom = nrf91_socket_offload_recvfrom,
	.getsockopt = nrf91_socket_offload_getsockopt,
	.setsockopt = nrf91_socket_offload_setsockopt,
};

static inline bool proto_is_secure(int proto)
{
	return (proto >= IPPROTO_TLS_1_0 && proto <= IPPROTO_TLS_1_2) ||
	       (proto >= IPPROTO_DTLS_1_0 && proto <= IPPROTO_DTLS_1_2);
}

static inline bool af_is_supported(int family)
{
	return (family == AF_PACKET) || (family == AF_INET) || (family == AF_INET6);
}

static bool nrf91_socket_is_supported(int family, int type, int proto)
{
	if (offload_disabled) {
		return false;
	}

	if (tls_offload_disabled && proto_is_secure(proto)) {
		return false;
	}

	return af_is_supported(family);
}

static int native_socket(int family, int type, int proto, bool *offload_lock)
{
	int sock;

