nrfconnect/sdk-nrf/lib/nrf_modem_lib/nrf91_sockets.c
	type = type & ~(SOCK_NATIVE | SOCK_NATIVE_TLS);

	/* Lock the scheduler for the time of a socket creation to prevent
	 * race condition when offloading is disabled.
	 */
	k_sched_lock();
	*offload_lock = true;
	sock = zsock_socket(family, type, proto);
	*offload_lock = false;
	k_sched_unlock();

	return sock;
}

static int nrf91_socket_create(int family, int type, int proto)
{
	int fd, sd;
	struct nrf_sock_ctx *ctx;

	if (type & SOCK_NATIVE) {
		return native_socket(family, type, proto, &offload_disabled);
	} else if (type & SOCK_NATIVE_TLS) {
		return native_socket(family, type, proto, &tls_offload_disabled);
	}

	fd = z_reserve_fd();
	if (fd < 0) {
		return -1;
	}

	sd = nrf91_socket_offload_socket(family, type, proto);
	if (sd < 0) {
		z_free_fd(fd);
		return -1;
	}

	ctx = allocate_ctx(sd);
	if (ctx == NULL) {
		errno = ENOMEM;
		nrf_close(sd);
		z_free_fd(fd);
		return -1;
	}

	z_finalize_fd(fd, ctx,
		      (const struct fd_op_vtable *)&nrf91_socket_fd_op_vtable);

	return fd;
}

#define NRF91_SOCKET_PRIORITY 40

NET_SOCKET_OFFLOAD_REGISTER(nrf91_socket, NRF91_SOCKET_PRIORITY, AF_UNSPEC,
		    nrf91_socket_is_supported, nrf91_socket_create);

/* Create a network interface for nRF91 */

static int nrf91_socket_offload_init(const struct device *arg)
{
	ARG_UNUSED(arg);

	for (int i = 0; i < ARRAY_SIZE(offload_ctx); i++) {
		offload_ctx[i].nrf_fd = -1;
	}

	return 0;
}

static const struct socket_dns_offload nrf91_socket_dns_offload_ops = {
	.getaddrinfo = nrf91_socket_offload_getaddrinfo,
	.freeaddrinfo = nrf91_socket_offload_freeaddrinfo,
};

static struct nrf91_iface_data {
	struct net_if *iface;
} nrf91_iface_data;

static void nrf91_iface_api_init(struct net_if *iface)
{
	nrf91_iface_data.iface = iface;

	iface->if_dev->socket_offload = nrf91_socket_create;

	socket_offload_dns_register(&nrf91_socket_dns_offload_ops);

	if (!IS_ENABLED(CONFIG_NRF_MODEM_LIB_NET_IF_AUTO_START)) {
		net_if_flag_set(iface, NET_IF_NO_AUTO_START);
	}
}

static int nrf91_iface_enable(const struct net_if *iface, bool enabled)
{
#if defined(CONFIG_NRF_MODEM_LIB_NET_IF)
	/* Enables or disable the device (in response to admin state change) */
	extern int lte_net_if_enable(void);
	extern int lte_net_if_disable(void);

	return enabled ? lte_net_if_enable() :
			 lte_net_if_disable();
#else
	ARG_UNUSED(iface);
	ARG_UNUSED(enabled);
	return 0;
#endif /* CONFIG_NRF_MODEM_LIB_NET_IF */
}

static struct offloaded_if_api nrf91_iface_offload_api = {
	.iface_api.init = nrf91_iface_api_init,
	.enable = nrf91_iface_enable,
};

/* TODO Get the actual MTU for the nRF91 LTE link. */
NET_DEVICE_OFFLOAD_INIT(nrf91_socket, "nrf91_socket",
			nrf91_socket_offload_init,
			NULL,
			&nrf91_iface_data, NULL,
			0, &nrf91_iface_offload_api, 1280);

#if defined(CONFIG_NRF_MODEM_LIB_NET_IF)
extern struct conn_mgr_conn_api lte_net_if_conn_mgr_api;
CONN_MGR_CONN_DEFINE(NRF_MODEM_LIB_NET_IF, &lte_net_if_conn_mgr_api);
CONN_MGR_BIND_CONN(nrf91_socket, NRF_MODEM_LIB_NET_IF);
#endif /* CONFIG_NRF_MODEM_LIB_NET_IF */

#endif /* CONFIG_NET_SOCKETS_OFFLOAD */
